InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыПоставщиков</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Розничная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скидка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РаботаСЦенами/Ext/Module.bsl
Функция ЦенаНаДатуПродажи(Номенклатура, ТекДата = Неопределено, ТипЦены = Неопределено) Экспорт
	Запрос = Новый Запрос();
	Если ТипЦены = Неопределено Тогда
		ТипЦены = Перечисления.ТипыЦен.Розничная;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныСрезПоследних.Период КАК Период,
	               |	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныСрезПоследних.ТипЦены КАК ТипЦены,
	               |	ЦеныСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.Цены.СрезПоследних(
	               |			&Период,
	               |			Номенклатура = &Номенклатура
	               |				И ТипЦены = &ТипЦены) КАК ЦеныСрезПоследних"
				   ;
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Период", ТекДата);
	Запрос.УстановитьПараметр("ТипЦены", ТипЦены);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("Цена не найдена");
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();	
	
	Возврат Выборка.Цена;
	
КонецФункции

Функция ПолучитьЦенуНаКонкретнуюДату(Номенклатура, Дата, ТипЦены) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	                 |	Цены.Цена КАК Цена
	                 |ИЗ
	                 |	РегистрСведений.Цены КАК Цены
	                 |ГДЕ
	                 |	Цены.Номенклатура = &Номенклатура
	                 |	И Цены.ТипЦены = &ТипЦены
	                 |	И Цены.Период = &Период";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ТипЦены", ТипЦены);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Цена;
КонецФункции

Функция ПолучитьЦенуПоКонтрагенту(Номенклатура, Поставщик, ТекДата) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
		         |	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена
		         |ИЗ
		         |	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(
		         |			&Период,
		         |			&Номенклатура = Номенклатура
		         |				И &Поставщик = Поставщик) КАК ЦеныНоменклатурыПоставщиковСрезПоследних"
				 ;
	Запрос.УстановитьПараметр("Период", ТекДата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Поставщик", Поставщик);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Цена;
	Иначе
		Текст = "Цена не найдена";
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();
		Возврат 0;
	КонецЕсли;	
КонецФункции
